Repository: mrJSK/line_survey_pro
Catalog: lib/l10n/app_*.arb
Languages: hi

# noWorkerProfilesFoundTitle
source: No worker profiles found or assigned tasks to track.
hi: कोई कार्यकर्ता प्रोफ़ाइल नहीं मिली या ट्रैक करने के लिए कार्य असाइन नहीं किए गए।

# linesAssignedManagerCount
source: Lines Assigned: {count}
hi: असाइन की गई लाइनें: {count}

# totalTowersAssignedManagerCount
source: Total Towers Assigned: {count}
hi: कुल असाइन किए गए टावर: {count}

source: Tasks Assigned by Them: {count}
hi: उनके द्वारा असाइन किए गए कार्य: {count}

# viewButton
source: View >
hi: देखें >

# accountNotApproved
source: Your account is not approved.
hi: आपका खाता अनुमोदित नहीं है।

# accountApprovalMessage
source: Please wait for administrator approval or contact support.
hi: कृपया प्रशासक अनुमोदन की प्रतीक्षा करें या सहायता से संपर्क करें।

source: Account Status Unknown
hi: खाता स्थिति अज्ञात

# unexpectedAccountStatus
source: An unexpected account status was encountered. Please contact support.
hi: एक अप्रत्याशित खाता स्थिति का सामना करना पड़ा। कृपया सहायता से संपर्क करें।

# unassignedRoleTitle
source: Your account role is not assigned or recognized.
hi: आपकी खाता भूमिका असाइन या पहचानी नहीं गई है।

# unassignedRoleMessage
source: Please ensure your role (Worker, Manager, or Admin) is correctly assigned by an administrator in the Firebase Console.
hi: कृपया सुनिश्चित करें कि आपकी भूमिका (कार्यकर्ता, प्रबंधक, या प्रशासक) Firebase कंसोल में एक प्रशासक द्वारा सही ढंग से असाइन की गई है।

source: Survey Progress Overview
hi: समग्र सर्वेक्षण प्रगति

source: Patrolling the future...
hi: भविष्य की गश्त...

# anUnexpectedErrorOccurred
source: An unexpected error occurred: {error}
hi: एक अप्रत्याशित त्रुटि हुई: {error}

source: Google Sign-In cancelled.
hi: गूगल साइन-इन रद्द कर दिया गया।

# userProfileNotFound
source: User profile not found after sign-in. Please try again.
hi: साइन-इन के बाद उपयोगकर्ता प्रोफ़ाइल नहीं मिली। कृपया पुनः प्रयास करें।

source: User not found after sign-in.
hi: साइन-इन के बाद उपयोगकर्ता नहीं मिला।

# accountExistsWithDifferentCredential
source: An account already exists with different credentials.
hi: एक खाता पहले से ही विभिन्न क्रेडेंशियल्स के साथ मौजूद है।

# invalidCredential
source: The credential provided is invalid.
hi: प्रदान की गई क्रेडेंशियल अमान्य है।

# userDisabled
source: The user associated with the given credential has been disabled.
hi: दिए गए क्रेडेंशियल से जुड़ा उपयोगकर्ता अक्षम कर दिया गया है।

# operationNotAllowed
source: Google Sign-In is not enabled for this project.
hi: इस परियोजना के लिए गूगल साइन-इन सक्षम नहीं है।

# networkRequestFailed
source: A network error occurred. Please check your internet connection.
hi: नेटवर्क त्रुटि हुई। कृपया अपना इंटरनेट कनेक्शन जांचें।

# signInFailed
source: Sign-in failed: {error}
hi: साइन-इन विफल: {error}

# noInternetConnection
source: No internet connection. Please connect and try again.
hi: कोई इंटरनेट कनेक्शन नहीं। कृपया कनेक्ट करें और पुनः प्रयास करें।

# errorCheckingConnectivity
source: Error checking connectivity: {error}
hi: कनेक्टिविटी जांचने में त्रुटि: {error}

# stillNoInternet
source: Still no internet connection.
hi: अभी भी कोई इंटरनेट कनेक्शन नहीं।

# internetRestored
source: Internet connection restored!
hi: इंटरनेट कनेक्शन बहाल!

# errorLoadingUsers
source: Error loading users: {error}
hi: उपयोगकर्ता लोड करने में त्रुटि: {error}

# errorInitiatingUserStream
source: Error initiating user stream: {error}
hi: उपयोगकर्ता स्ट्रीम प्रारंभ करने में त्रुटि: {error}

# errorLoadingManagerLines
source: Error loading manager lines: {error}
hi: प्रबंधक लाइनें लोड करने में त्रुटि: {error}

# errorLoadingManagerTasks
source: Error loading manager tasks: {error}
hi: प्रबंधक कार्य लोड करने में त्रुटि: {error}

# errorStreamingManagerLines
source: Error streaming transmission lines: {error}
hi: ट्रांसमिशन लाइनें स्ट्रीम करने में त्रुटि: {error}

# errorStreamingManagerTasks
source: Error streaming all tasks: {error}
hi: सभी कार्य स्ट्रीम करने में त्रुटि: {error}

# errorStreamingSurveyRecords
source: Error streaming all survey records: {error}
hi: सभी सर्वेक्षण रिकॉर्ड स्ट्रीम करने में त्रुटि: {error}

# errorLoadingDashboardData
source: Error loading dashboard data: {error}
hi: डैशबोर्ड डेटा लोड करने में त्रुटि: {error}

# errorStreamingLocalSurveyRecords
source: Error streaming local survey records: {error}
hi: स्थानीय सर्वेक्षण रिकॉर्ड स्ट्रीम करने में त्रुटि: {error}

# errorStreamingYourTasks
source: Error streaming your tasks: {error}
hi: आपके कार्य स्ट्रीम करने में त्रुटि: {error}

# errorStreamingYourSurveyRecords
source: Error streaming your survey records: {error}
hi: आपके सर्वेक्षण रिकॉर्ड स्ट्रीम करने में त्रुटि: {error}

# errorStreamingAllTasks
source: Error streaming all tasks: {error}
hi: सभी कार्य स्ट्रीम करने में त्रुटि: {error}

# errorStreamingAllSurveyRecords
source: Error streaming all survey records: {error}
hi: सभी सर्वेक्षण रिकॉर्ड स्ट्रीम करने में त्रुटि: {error}

# errorStreamingAllUsers
source: Error streaming all users: {error}
hi: सभी उपयोगकर्ता स्ट्रीम करने में त्रुटि: {error}

# errorLoadingData
source: Error loading data: {error}
hi: डेटा लोड करने में त्रुटि: {error}

# towerNumberInvalid
source: Please enter a tower number
hi: कृपया एक टॉवर संख्या दर्ज करें

# towerNumberPositive
source: Please enter a valid positive number
hi: कृपया एक मान्य धनात्मक संख्या दर्ज करें

# towerOutOfRange
source: Tower number {towerNumber} is outside the assigned range ({range}).
hi: टॉवर संख्या {towerNumber} सीमा ({range}) से बाहर है।

# towerSpecificRequired
source: You are assigned to survey only Tower {towerNumber}.
hi: आपको केवल टॉवर {towerNumber} का सर्वेक्षण करने के लिए असाइन किया गया है।

# accuracyLow
source: Accuracy less than {requiredAccuracy}m. Please wait or move to an open area for better GPS signal.
hi: सटीकता {requiredAccuracy}मी से कम है। कृपया बेहतर जीपीएस सिग्नल के लिए प्रतीक्षा करें या खुले क्षेत्र में जाएं।

# towerAlreadyExists
source: A survey for Tower {towerNumber} at this location ({distance}m from previous record) already exists for Line {lineName}. Please ensure you are at a new tower or update the existing record if this is a re-survey.
hi: लाइन {lineName} के लिए टॉवर {towerNumber} पर इस स्थान ({distance}मी पिछले रिकॉर्ड से) पर एक सर्वेक्षण पहले से मौजूद है। कृपया सुनिश्चित करें कि आप एक नए टॉवर पर हैं या यदि यह पुनः सर्वेक्षण है तो मौजूदा रिकॉर्ड अपडेट करें।

# towerTooClose
source: Another surveyed tower on Line {lineName} is too close ({distance}m from Tower {towerNumber}). All DIFFERENT survey points on the same line must be at least {minDistance} meters apart.
hi: लाइन {lineName} पर एक और सर्वेक्षण किया गया टॉवर बहुत करीब है ({distance}मी टॉवर {towerNumber} से)। एक ही लाइन पर सभी अलग-अलग सर्वेक्षण बिंदु कम से कम {minDistance} मीटर अलग होने चाहिए।

# userNotLoggedIn
source: User not logged in. Cannot save survey.
hi: उपयोगकर्ता लॉग इन नहीं है। सर्वेक्षण सहेजा नहीं जा सकता।

# errorProcessingDetails
source: Error processing details: {error}
hi: विवरण संसाधित करने में त्रुटि: {error}

# errorSavingPhotoAndRecordLocally
source: Error saving photo and record locally: {error}
hi: फोटो और रिकॉर्ड स्थानीय रूप से सहेजने में त्रुटि: {error}

# errorSavingLineSurveyDetails
source: Error saving line survey details: {error}
hi: लाइन सर्वेक्षण विवरण सहेजने में त्रुटि: {error}

# errorLoadingLines
source: Error loading lines: {error}
hi: लाइनें लोड करने में त्रुटि: {error}

# errorInitializingLineStream
source: Error initializing line stream: {error}
hi: लाइन स्ट्रीम प्रारंभ करने में त्रुटि: {error}

# invalidTowerNumberInput
source: Invalid "From" tower number. Must be a whole number.
hi: अवैध "से" टॉवर संख्या। एक पूर्ण संख्या होनी चाहिए।

# invalidToTowerNumberInput
source: Invalid "To" tower number. Must be a whole number.
hi: अवैध "तक" टॉवर संख्या। एक पूर्ण संख्या होनी चाहिए।

# selectWorkerError
source: Please select a worker.
hi: कृपया एक कार्यकर्ता चुनें।

# selectLineError
source: Please select a line.
hi: कृपया एक लाइन चुनें।

# selectDueDateError
source: Please select a due date.
hi: कृपया एक देय तिथि चुनें।

# allTowersRequiresLine
source: "All" requires a selected line with defined towers.
hi: "सभी" के लिए परिभाषित टावरों के साथ एक चयनित लाइन की आवश्यकता है।

source: All Towers
hi: सभी टावर

source: Survey Entry
hi: सर्वेक्षण प्रविष्टि

# moveToOpenArea
source: Move to an open area.
hi: खुले क्षेत्र में जाएं।

# couldNotGetLocationWithinSeconds
source: Could not get any location within {seconds} seconds. Please try again.
hi: समस्त {seconds} सेकंड के भीतर कोई स्थान प्राप्त नहीं हो सका। कृपया पुनः प्रयास करें।

# locationAcquired
source: Location acquired with best available accuracy: {accuracy}m.
hi: सर्वोत्तम उपलब्ध सटीकता के साथ स्थान प्राप्त हुआ: {accuracy}मी।

# unexpectedErrorStartingLocation
source: An unexpected error occurred while starting location: {error}
hi: स्थान प्रारंभ करते समय एक अप्रत्याशित त्रुटि हुई: {error}

# timeoutInSeconds
source: Timeout in {seconds}s
hi: समय समाप्त होने में {seconds}सेकंड

source: Get Current Location
hi: वर्तमान स्थान प्राप्त करें

# fillAllRequiredFields
source: Please fill all required fields correctly.
hi: कृपया सभी आवश्यक फ़ील्ड सही ढंग से भरें।

source: Good
hi: अच्छा

source: Backfilling Required
hi: बैकफिलिंग आवश्यक

source: Revetment Wall Required
hi: रिवेटमेंट वॉल आवश्यक

source: Excavation Of Soil Required
hi: मिट्टी की खुदाई आवश्यक

source: Rusted
hi: जंग लगा हुआ

source: Bent
hi: मुड़ा हुआ

source: Hanging
hi: लटका हुआ

source: Damaged
hi: क्षतिग्रस्त

source: Cracked
hi: फटा हुआ

source: Broken
hi: टूटा हुआ

source: Flashover
hi: फ्लैशओवर

source: Dirty
hi: गंदा

source: Loose
hi: ढीला

source: Bolt Missing
hi: बोल्ट गायब

source: Spacers Missing
hi: स्पेसर्स गायब

source: Corroded
hi: संक्षारित

source: Faded
hi: फीका पड़ा हुआ

source: Disconnected
hi: डिस्कनेक्टेड

source: Open
hi: खुला

source: Leaking
hi: लीक हो रहा है

source: Present
hi: उपस्थित

source: Trimming Required
hi: ट्रिमिंग आवश्यक

source: Lopping Required
hi: लॉपिंग आवश्यक

source: Cutting Required
hi: कटिंग आवश्यक

source: Minor
hi: मामूली

source: Moderate
hi: मध्यम

source: Severe
hi: गंभीर

source: Intact
hi: अक्षुण्ण

source: Not Applicable
hi: लागू नहीं

# taskAndAssociatedRecordsDeleted
source: Task and associated local records deleted successfully!
hi: कार्य और संबंधित स्थानीय रिकॉर्ड सफलतापूर्वक हटा दिए गए!

source: Task status updated!
hi: कार्य स्थिति अपडेट की गई!

# errorUpdatingTask
source: Error updating task: {error}
hi: कार्य अपडेट करने में त्रुटि: {error}

# errorUploadingUnsyncedRecords
source: Error uploading unsynced records: {error}
hi: असिंक्रनाइज़ किए गए रिकॉर्ड अपलोड करने में त्रुटि: {error}

source: Yes
hi: हाँ

source: No
hi: नहीं

# welcomeUser
source: Welcome, {displayName} ({role})!
hi: स्वागत है, {displayName} ({role})!

source: to patrol
hi: गश्त करने के लिए

source: Your Survey Log for this Task:
hi: इस कार्य के लिए आपका सर्वेक्षण लॉग:

# noSurveysRecordedForThisTask
source: No surveys recorded for this task yet.
hi: इस कार्य के लिए अभी तक कोई सर्वेक्षण रिकॉर्ड नहीं किया गया है।

source: at
hi: पर

source: Re-checking account status...
hi: खाता स्थिति पुनः जांच रहा है...

# errorLoadingLineRecords
source: Error loading line records: {error}
hi: लाइन रिकॉर्ड लोड करने में त्रुटि: {error}

source: National Highway
hi: राष्ट्रीय राजमार्ग

source: State Highway
hi: राज्य राजमार्ग

source: Over Bridge
hi: ओवर ब्रिज

source: Underpass
hi: अंडरपास

source: Private Tube Well
hi: निजी ट्यूबवेल

source: NOT OKAY
hi: ठीक नहीं

# unassignedRole
source: Unassigned
hi: असाइन नहीं किया गया

source: Missing
hi: गायब

source: Patrolling Details
hi: गश्त विवरण

source: Switch to Hindi
hi: हिंदी में बदलें

source: Switch to English
hi: अंग्रेज़ी में बदलें

# errorDeletingTask
source: Error deleting task: {error}
hi: कार्य हटाने में त्रुटि: {error}

source: Span Length
hi: स्पैन लंबाई

source: On
hi: पर

source: Select condition of OPGW
hi: ओपीजीडब्ल्यू की स्थिति चुनें

source: Select condition of Earth Wire
hi: अर्थ वायर की स्थिति चुनें

source: Select condition of Conductor
hi: कंडक्टर की स्थिति चुनें

source: Select Mid Span Joint
hi: मिड स्पैन जॉइंट चुनें

source: Select New Construction
hi: नया निर्माण चुनें

source: Select Spacers
hi: स्पेसर चुनें

source: Select Vibration Damper
hi: वाइब्रेशन डैम्पर चुनें

source: Select Road Crossing
hi: सड़क क्रॉसिंग प्रकार चुनें

source: Select River Crossing
hi: नदी क्रॉसिंग प्रकार चुनें

source: Select Electrical Line
hi: विद्युत लाइन प्रकार चुनें

source: Select Railway Crossing
hi: रेलवे क्रॉसिंग प्रकार चुनें

source: Select Road Crossing Types
hi: सड़क क्रॉसिंग प्रकार चुनें

source: Select Electrical Line Types
hi: विद्युत लाइन प्रकार चुनें

source: Road Crossing Name
hi: सड़क क्रॉसिंग नाम

source: Enter road crossing name
hi: सड़क क्रॉसिंग नाम दर्ज करें

source: Electrical Line Name
hi: विद्युत लाइन नाम

source: Enter electrical line name
hi: विद्युत लाइन नाम दर्ज करें

# hasElectricalLineCrossing
source: Has Electrical Crossing
hi: विद्युत लाइन क्रॉसिंग है

source: Has Road Crossing
hi: सड़क क्रॉसिंग है

source: Bottom Conductor
hi: तल कंडक्टर

source: Top Conductor
hi: शीर्ष कंडक्टर

# oK
source: OKAY
hi: ठीक है

# lineSurveyDetailsSaved
source: Line survey details saved successfully!
hi: लाइन सर्वेक्षण विवरण सफलतापूर्वक सहेजे गए!

source: Select Bottom Conductor
hi: तल कंडक्टर चुनें

source: Select Top Conductor
hi: शीर्ष कंडक्टर चुनें

source: Tower Type
hi: टॉवर प्रकार

source: Select tower type
hi: टॉवर प्रकार चुनें

source: Overdue
hi: अतिदेय

# daysLeft
source: Days Left {daysLeft}
hi: {daysLeft} दिन शेष

source: Progress
hi: प्रगति

# taskReassignedSuccessfully
source: Task of {lineName} from {targetTowerRange} to {displayName}, {email} reassigned successfully!
hi: कार्य सफलतापूर्वक पुनः असाइन किया गया!

# selectWorkerToReassign
source: Select a worker to reassign this task
hi: इस कार्य को पुनः असाइन करने के लिए एक कार्यकर्ता चुनें

# taskCancelledSuccessfully
source: Task of {lineName} from {targetTowerRange} cancelled successfully, !
hi: {lineName} से {targetTowerRange} का कार्य सफलतापूर्वक रद्द किया गया!

# confirmCancellation
source: Are you sure you want to cancel this task? This action cannot be undone.
hi: क्या आप इस कार्य को रद्द करना चाहते हैं? यह कार्रवाई पूर्ववत नहीं की जा सकती है।

# cancelTaskConfirmation
source: Are you sure you want to cancel the task for Line: {lineName}, Towers: {towerRange} from {assignedToUserName}? This will also delete any associated survey progress in the app for this task. This action cannot be undone.
hi: क्या आप लाइन: {lineName}, टावरों: {towerRange} से {assignedToUserName} का कार्य रद्द करना चाहते हैं? इससे इस कार्य के लिए ऐप में किसी भी संबंधित सर्वेक्षण प्रगति को भी हटा दिया जाएगा। यह कार्रवाई पूर्ववत नहीं की जा सकती है।

source: Cancel Task
hi: कार्य रद्द करें

source: Reassign Task
hi: कार्य पुनः असाइन करें
