Repository: mrJSK/line_survey_pro
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Line Survey Pro
hi: लाइन सर्वे प्रो

# welcomeMessage
source: Welcome to Line Survey Pro!
hi: लाइन सर्वे प्रो में आपका स्वागत है!

source: Sign In
hi: साइन इन करें

source: Sign in with Google
hi: गूगल से साइन इन करें

# signInPrompt
source: Please sign in to continue using the app.
hi: कृपया ऐप का उपयोग जारी रखने के लिए साइन इन करें।

source: Survey Dashboard
hi: सर्वेक्षण डैशबोर्ड

source: Export Records
hi: रिकॉर्ड निर्यात करें

source: Real-Time Tasks
hi: वास्तविक समय कार्य

source: Info
hi: जानकारी

source: User Management
hi: उपयोगकर्ता प्रबंधन

source: Manage Transmission Lines
hi: ट्रांसमिशन लाइनें प्रबंधित करें

source: Logout
hi: लॉग आउट

source: Language
hi: भाषा

source: Select Language
hi: भाषा चुनें

source: Account Pending Approval
hi: खाता अनुमोदन लंबित है

# awaitingApprovalMessage
source: Your account is awaiting approval from an administrator. Once approved, you will gain full access to the app features.
hi: आपका खाता एक प्रशासक से अनुमोदन की प्रतीक्षा कर रहा है। एक बार अनुमोदित होने के बाद, आपको ऐप सुविधाओं तक पूर्ण पहुंच प्राप्त होगी।

source: Account Rejected
hi: खाता अस्वीकृत

# rejectedMessage
source: Unfortunately, your account has been rejected by an administrator. Please contact support for more information.
hi: दुर्भाग्य से, आपका खाता एक प्रशासक द्वारा अस्वीकृत कर दिया गया है। अधिक जानकारी के लिए कृपया सहायता से संपर्क करें।

# recheckStatus
source: Re-check Status (Requires Sign Out)
hi: स्थिति पुनः जांचें (साइन आउट की आवश्यकता है)

# noInternetTitle
source: Oops! No Internet Connection
hi: क्षमा करें! कोई इंटरनेट कनेक्शन नहीं है

# noInternetMessage
source: It seems you're offline. Please check your network settings and try again.
hi: ऐसा लगता है कि आप ऑफ़लाइन हैं। कृपया अपनी नेटवर्क सेटिंग्स जांचें और पुनः प्रयास करें।

source: Try Again
hi: पुनः प्रयास करें

source: Your Assigned Tasks:
hi: आपके असाइन किए गए कार्य:

source: All Tasks:
hi: सभी कार्य:

source: Assign New Task
hi: नया कार्य असाइन करें

source: Upload Unsynced Details
hi: असिंक्रनाइज़ किए गए विवरण अपलोड करें

# noTasksAssigned
source: No tasks assigned to you yet.
hi: अभी तक आपको कोई कार्य असाइन नहीं किया गया है।

source: No tasks available.
hi: कोई कार्य उपलब्ध नहीं है।

source: Line
hi: लाइन

source: Tower
hi: टॉवर

source: Status
hi: स्थिति

# patrolledStatus
source: Patrolled
hi: गश्त की गई

# inProgressUploadedStatus
source: In Progress (Uploaded)
hi: प्रगति में (अपलोड किया गया)

# inProgressLocalStatus
source: In Progress (Local)
hi: प्रगति में (स्थानीय)

# pendingStatus
source: Pending
hi: लंबित

# continueSurvey
source: Continue Survey for this Task
hi: इस कार्य के लिए सर्वेक्षण जारी रखें

source: Task
hi: कार्य

source: Towers
hi: टॉवर

# patrolledCount
source: Patrolled
hi: गश्त की गई

# uploadedCount
source: Uploaded
hi: अपलोड किया गया

source: Due
hi: देय

source: Task Options
hi: कार्य विकल्प

source: Edit Task
hi: कार्य संपादित करें

source: Delete Task
hi: कार्य मिटाएँ

source: Confirm Deletion
hi: पुष्टि करें हटाना

# deleteTaskConfirmation
source: Are you sure you want to delete the task for Line: {lineName}, Towers: {towerRange}? This will also delete any associated survey progress in the app for this task. This action cannot be undone.
hi: क्या आप लाइन: {lineName}, टावरों: {towerRange} के लिए कार्य को हटाना चाहते हैं? इससे इस कार्य के लिए ऐप में किसी भी संबंधित सर्वेक्षण प्रगति को भी हटा दिया जाएगा। यह कार्रवाई पूर्ववत नहीं की जा सकती।

source: Cancel
hi: रद्द करें

source: Delete
hi: हटाएँ

# uploadSuccess
source: {count} record details uploaded successfully!
hi: {count} रिकॉर्ड विवरण सफलतापूर्वक अपलोड किए गए!

# noUnsyncedRecords
source: No unsynced records to upload.
hi: अपलोड करने के लिए कोई असिंक्रनाइज़ किए गए रिकॉर्ड नहीं हैं।

source: Camera permission denied.
hi: कैमरा अनुमति अस्वीकृत।

# errorInitializingCamera
source: Error initializing camera: {error}
hi: कैमरा प्रारंभ करने में त्रुटि: {error}

source: No cameras found.
hi: कोई कैमरा नहीं मिला।

# errorCapturingPicture
source: Error capturing picture: {error}
hi: चित्र कैप्चर करने में त्रुटि: {error}

# noPhotoCaptured
source: No photo captured to save.
hi: सहेजने के लिए कोई फोटो कैप्चर नहीं किया गया।

# photoSavedLocally
source: Photo and record saved locally!
hi: फोटो और रिकॉर्ड स्थानीय रूप से सहेजा गया!

# cameraCaptureCancelled
source: Camera capture cancelled or failed. Data not saved.
hi: कैमरा कैप्चर रद्द या विफल हो गया। डेटा सहेजा नहीं गया।

source: Take Photo
hi: फोटो लें

source: Retake
hi: पुनः लें

source: Save
hi: सहेजें

source: Saving...
hi: सहेजा जा रहा है...

source: Back
hi: वापस

# lineDetails
source: Line: {lineName}
hi: लाइन: {lineName}

# towerDetails
source: Tower: {towerNumber}
hi: टॉवर: {towerNumber}

source: Lat
hi: अक्षांश

source: Lon
hi: देशांतर

source: Time
hi: समय

source: Review Photo
hi: फोटो की समीक्षा करें

# imageNotFound
source: Image not found or corrupted.
hi: छवि नहीं मिली या दूषित है।

source: Location permission denied.
hi: स्थान अनुमति अस्वीकृत।

# locationServiceDisabled
source: Location services are disabled. Please enable them to get GPS coordinates.
hi: स्थान सेवाएं अक्षम हैं। जीपीएस निर्देशांक प्राप्त करने के लिए कृपया उन्हें सक्षम करें।

# locationPermissionPermanentlyDenied
source: Location permissions are permanently denied. Please enable them from your device's app settings.
hi: स्थान अनुमतियाँ स्थायी रूप से अस्वीकृत हैं। कृपया उन्हें अपनी डिवाइस की ऐप सेटिंग्स से सक्षम करें।

# errorGettingLocation
source: Error getting location stream: {error}
hi: स्थान स्ट्रीम प्राप्त करने में त्रुटि: {error}

source: Fetching location
hi: स्थान प्राप्त कर रहा है

source: Current
hi: वर्तमान

# requiredAccuracyAchieved
source: Achieved: {accuracy}m (Required < {requiredAccuracy}m)
hi: प्राप्त: {accuracy}मी (आवश्यक < {requiredAccuracy}मी)

# currentAccuracy
source: Current: {accuracy}m (Required < {requiredAccuracy}m)
hi: वर्तमान: {accuracy}मी (आवश्यक < {requiredAccuracy}मी)

# timeoutReached
source: Timeout reached. {message}
hi: समय समाप्त। {message}

source: No location obtained.
hi: कोई स्थान प्राप्त नहीं हुआ।

# overallProgress
source: Overall Survey Progress
hi: समग्र सर्वेक्षण प्रगति

source: Total Managers:
hi: कुल प्रबंधक:

source: Total Workers:
hi: कुल कार्यकर्ता:

source: Total Lines:
hi: कुल लाइनें:

source: Total Towers in System:
hi: सिस्टम में कुल टावर:

source: Pending Approvals:
hi: लंबित अनुमोदन:

source: Latest Pending Requests
hi: नवीनतम लंबित अनुरोध

source: No pending requests.
hi: कोई लंबित अनुरोध नहीं।

# managersAndAssignments
source: Managers & Their Assignments
hi: प्रबंधक और उनके असाइनमेंट

source: No managers found.
hi: कोई प्रबंधक नहीं मिला।

source: Progress by Worker:
hi: कार्यकर्ता द्वारा प्रगति:

# noWorkerProfilesFound
source: No worker profiles found or assigned tasks to track.
hi: कोई कार्यकर्ता प्रोफ़ाइल नहीं मिली या ट्रैक करने के लिए कार्य असाइन नहीं किए गए।

source: Lines Assigned
hi: असाइन की गई लाइनें

source: Lines Patrolled
hi: गश्त की गई लाइनें

source: Lines Working/Pending
hi: कार्यरत/लंबित लाइनें

# linesUnderSupervision
source: Lines under your supervision:
hi: आपकी निगरानी में लाइनें:

# noLinesOrTasksAvailable
source: No lines or tasks available for your role within your assigned areas.
hi: आपकी भूमिका के लिए आपके असाइन किए गए क्षेत्रों में कोई लाइन या कार्य उपलब्ध नहीं है।

source: Assigned Task Details:
hi: असाइन किए गए कार्य विवरण:

# lineNameField
source: Line Name
hi: लाइन का नाम

source: Assigned Towers
hi: असाइन किए गए टावर

# dueDateField
source: Due Date
hi: देय तिथि

source: Add New Survey Record
hi: नया सर्वेक्षण रिकॉर्ड जोड़ें

# towerNumberField
source: Tower Number
hi: टॉवर संख्या

source: Enter tower number
hi: टॉवर संख्या दर्ज करें

# gpsCoordinates
source: Current GPS Coordinates:
hi: वर्तमान जीपीएस निर्देशांक:

source: Refresh Location
hi: स्थान रीफ्रेश करें

source: Continue to Patrolling Details
hi: गश्त विवरण पर जारी रखें

source: Getting Location...
hi: स्थान प्राप्त कर रहा है...

source: Required Accuracy Not Met
hi: आवश्यक सटीकता पूरी नहीं हुई

source: Soil Condition
hi: मिट्टी की स्थिति

source: Select soil condition
hi: मिट्टी की स्थिति चुनें

source: Stub / Coping Leg
hi: स्टब / कॉपिंग लेग

source: Select stub/coping leg status
hi: स्टब/कॉपिंग लेग स्थिति चुनें

source: Earthing
hi: अर्थिंग

source: Select earthing status
hi: अर्थिंग स्थिति चुनें

source: Condition of Tower Parts
hi: टॉवर भागों की स्थिति

source: Select condition of tower parts
hi: टॉवर भागों की स्थिति चुनें

source: Status of Insulator
hi: इन्सुलेटर की स्थिति

source: Select insulator status
hi: इन्सुलेटर स्थिति चुनें

source: Jumper Status
hi: जम्पर स्थिति

source: Select jumper status
hi: जम्पर स्थिति चुनें

source: Hot Spots
hi: हॉट स्पॉट

source: Select hot spot status
hi: हॉट स्पॉट स्थिति चुनें

source: Number Plate
hi: नंबर प्लेट

source: Select number plate status
hi: नंबर प्लेट स्थिति चुनें

source: Danger Board
hi: खतरा बोर्ड

source: Select danger board status
hi: खतरा बोर्ड स्थिति चुनें

source: Phase Plate
hi: फेज प्लेट

source: Select phase plate status
hi: फेज प्लेट स्थिति चुनें

source: Nut and Bolt Condition
hi: नट और बोल्ट की स्थिति

source: Select nut and bolt condition
hi: नट और बोल्ट की स्थिति चुनें

source: Anti Climbing Device
hi: एंटी क्लाइंबिंग डिवाइस

source: Select anti-climbing device status
hi: एंटी-क्लाइंबिंग डिवाइस स्थिति चुनें

source: Wild Growth
hi: जंगली विकास

source: Select wild growth status
hi: जंगली विकास स्थिति चुनें

source: Bird Guard
hi: बर्ड गार्ड

source: Select bird guard status
hi: बर्ड गार्ड स्थिति चुनें

source: Bird Nest
hi: पक्षी का घोंसला

source: Select bird nest status
hi: पक्षी घोंसला स्थिति चुनें

source: Arching Horn
hi: आर्किंग हॉर्न

source: Select arching horn status
hi: आर्किंग हॉर्न स्थिति चुनें

source: Corona Ring
hi: कोरोना रिंग

source: Select corona ring status
hi: कोरोना रिंग स्थिति चुनें

source: Insulator Type
hi: इन्सुलेटर प्रकार

source: Select insulator type
hi: इन्सुलेटर प्रकार चुनें

source: OPGW Joint Box
hi: ओपीजीडब्ल्यू जॉइंट बॉक्स

source: Select OPGW Joint Box status
hi: ओपीजीडब्ल्यू जॉइंट बॉक्स स्थिति चुनें

source: Missing Tower Parts
hi: गुम हुए टॉवर पार्ट्स

source: Continue to Line Survey
hi: लाइन सर्वेक्षण पर जारी रखें

# enterDetailedObservations
source: Enter detailed patrolling observations for Tower {towerNumber} on {lineName}.
hi: लाइन {lineName} पर टॉवर {towerNumber} के लिए विस्तृत गश्त अवलोकन दर्ज करें।

# generalNotes
source: General Observations/Notes
hi: सामान्य अवलोकन/नोट्स

source: Building
hi: भवन

source: Tree
hi: वृक्ष

source: Number of Trees
hi: वृक्षों की संख्या

source: Condition of OPGW
hi: ओपीजीडब्ल्यू की स्थिति

source: Condition of Earth Wire
hi: अर्थ वायर की स्थिति

source: Condition of Conductor
hi: कंडक्टर की स्थिति

source: Mid Span Joint
hi: मिड स्पैन जॉइंट

source: New Construction
hi: नया निर्माण

source: Object on Conductor
hi: कंडक्टर पर वस्तु

source: Object on Earthwire
hi: अर्थवायर पर वस्तु

source: Spacers
hi: स्पेसर्स

source: Vibration Damper
hi: वाइब्रेशन डैम्पर

source: Road Crossing
hi: सड़क क्रॉसिंग

source: River Crossing
hi: नदी क्रॉसिंग

source: Electrical Line
hi: विद्युत लाइन

source: Railway Crossing
hi: रेलवे क्रॉसिंग

# saveDetailsAndGoToCamera
source: Save Details & Go to Camera
hi: विवरण सहेजें और कैमरे पर जाएं

source: Line Survey Details
hi: लाइन सर्वेक्षण विवरण

# noRecordsToExport
source: No records to export to CSV.
hi: निर्यात करने के लिए कोई रिकॉर्ड नहीं।

# allRecordsExported
source: All records exported to CSV and share dialog shown.
hi: सभी रिकॉर्ड CSV में निर्यात किए गए और शेयर डायलॉग दिखाया गया।

# failedToGenerateCsv
source: Failed to generate CSV file.
hi: CSV फ़ाइल बनाने में विफल।

# errorExportingCsv
source: Error exporting CSV: {error}
hi: CSV निर्यात करने में त्रुटि: {error}

source: Select Images to Share
hi: साझा करने के लिए छवियां चुनें

# noImagesAvailable
source: No images available locally to share.
hi: साझा करने के लिए स्थानीय रूप से कोई छवियां उपलब्ध नहीं हैं।

source: Select Line
hi: लाइन चुनें

source: Search Tower Number
hi: टॉवर संख्या खोजें

# noTowersFound
source: No towers found matching search.
hi: खोज से मेल खाने वाले कोई टॉवर नहीं मिले।

# noImagesForLine
source: No images for this line available locally.
hi: इस लाइन के लिए स्थानीय रूप से कोई छवियां उपलब्ध नहीं हैं।

# shareSelected
source: Share Selected ({count})
hi: चयनित साझा करें ({count})

# noValidImagesForShare
source: No valid images with overlays found for selected records to share.
hi: चयनित रिकॉर्ड साझा करने के लिए ओवरले के साथ कोई वैध छवियां नहीं मिलीं।

# selectedImagesShared
source: Selected images and details shared.
hi: चयनित छवियां और विवरण साझा किए गए।

# errorSharingImages
source: Error sharing images: {error}
hi: छवियां साझा करने में त्रुटि: {error}

# deleteRecordConfirmation
source: Are you sure you want to delete record for Tower {towerNumber} on {lineName}? This action cannot be undone.
hi: क्या आप लाइन {lineName} पर टॉवर {towerNumber} के लिए रिकॉर्ड हटाना चाहते हैं? यह कार्रवाई पूर्ववत नहीं की जा सकती।

# recordDeletedSuccessfully
source: Record for Tower {towerNumber} deleted successfully.
hi: टॉवर {towerNumber} के लिए रिकॉर्ड सफलतापूर्वक हटा दिया गया।

# errorDeletingRecord
source: Error deleting record: {error}
hi: रिकॉर्ड हटाने में त्रुटि: {error}

# imageNotAvailableLocally
source: Image not available locally for this record. Only details are synced.
hi: यह छवि इस रिकॉर्ड के लिए स्थानीय रूप से उपलब्ध नहीं है। केवल विवरण सिंक्रनाइज़ किए गए हैं।

source: Close Menu
hi: मेनू बंद करें

source: Actions
hi: कार्य

source: Share Images
hi: छवियां साझा करें

source: Export CSV
hi: CSV निर्यात करें

# noRecordsFoundConductSurvey
source: No survey records found. Conduct a survey first and save/upload it!
hi: कोई सर्वेक्षण रिकॉर्ड नहीं मिला। पहले एक सर्वेक्षण करें और उसे सहेजें/अपलोड करें!

# localRecordsPresentUpload
source: You have local records. Upload them to the cloud for full sync!
hi: आपके पास स्थानीय रिकॉर्ड हैं। पूर्ण सिंक के लिए उन्हें क्लाउड पर अपलोड करें!

source: View Photo
hi: फोटो देखें

source: Assign to Worker
hi: कार्यकर्ता को असाइन करें

# selectWorker
source: Select a worker
hi: एक कार्यकर्ता चुनें

# selectTransmissionLine
source: Select a transmission line
hi: एक ट्रांसमिशन लाइन चुनें

# fromTowerNumber
source: From Tower Number (e.g., 10)
hi: टॉवर संख्या से (उदाहरण के लिए, 10)

# toTowerNumber
source: To Tower Number (e.g., 30, leave empty for single tower)
hi: टॉवर संख्या तक (उदाहरण के लिए, 30, एकल टॉवर के लिए खाली छोड़ें)

source: Select Due Date
hi: देय तिथि चुनें

source: Assign Task
hi: कार्य असाइन करें

source: Save Changes
hi: परिवर्तन सहेजें

# invalidTowerRange
source: Invalid tower range. Please check From/To values.
hi: अवैध टॉवर सीमा। कृपया से/तक मान जांचें।

# numberOfTowersZero
source: Number of towers to patrol cannot be zero. Check range or line total towers if "All" is selected.
hi: गश्त करने के लिए टावरों की संख्या शून्य नहीं हो सकती। यदि "सभी" चुना गया है तो सीमा या लाइन के कुल टावर जांचें।

# towersExceedLineTotal
source: The total number of towers assigned to this line ({assigned}) exceeds the line's total towers ({total}). Please adjust the range.
hi: इस लाइन को असाइन किए गए टावरों की कुल संख्या ({assigned}) लाइन के कुल टावरों ({total}) से अधिक है। कृपया सीमा समायोजित करें।

# conflictOverlappingTask
source: Conflict: A task for Line: {lineName}, Towers: {towerRange} (Assigned to: {assignedTo}, Status: {status}) overlaps with this assignment.
hi: टकराव: लाइन: {lineName}, टावरों: {towerRange} (असाइन किए गए: {assignedTo}, स्थिति: {status}) के लिए एक कार्य इस असाइनमेंट के साथ ओवरलैप होता है।

source: Task assigned successfully!
hi: कार्य सफलतापूर्वक असाइन किया गया!

source: Task updated successfully!
hi: कार्य सफलतापूर्वक अपडेट किया गया!

# errorSavingTask
source: Error saving task: {error}
hi: कार्य सहेजने में त्रुटि: {error}

# cannotAssignEditTasks
source: Cannot {action} tasks at this time.
hi: इस समय कार्य {action} नहीं कर सकते।

# possibleReasons
source: Possible reasons: - Your account is not approved or you lack Manager/Admin role. - No worker accounts found. - No transmission lines loaded (or assigned to you if you are a Manager). (Add/Manage lines from "Manage Lines" in drawer)
hi: संभावित कारण: - आपका खाता अनुमोदित नहीं है या आपके पास प्रबंधक/प्रशासक भूमिका नहीं है। - कोई कार्यकर्ता खाते नहीं मिले। - कोई ट्रांसमिशन लाइन लोड नहीं हुई (या यदि आप प्रबंधक हैं तो आपको असाइन की गई)। (ड्रॉअर में "लाइनें प्रबंधित करें" से लाइनें जोड़ें/प्रबंधित करें)

source: Retry Loading Data
hi: डेटा पुनः लोड करें

# manageTransmissionLinesTitle
source: Manage Transmission Lines
hi: ट्रांसमिशन लाइनें प्रबंधित करें

source: Add New Transmission Line
hi: नई ट्रांसमिशन लाइन जोड़ें

source: Edit Transmission Line
hi: ट्रांसमिशन लाइन संपादित करें

source: Voltage Level
hi: वोल्टेज स्तर

# selectVoltageLevel
source: Please select a voltage level
hi: कृपया एक वोल्टेज स्तर चुनें

# lineBaseName
source: Line Base Name (e.g., Shamli Aligarh)
hi: लाइन आधार नाम (उदाहरण के लिए, शामली अलीगढ़)

# enterLineName
source: Please enter a line name
hi: कृपया एक लाइन नाम दर्ज करें

# towerRangeFromLabel
source: Tower Range From
hi: टॉवर रेंज से

source: Enter start tower
hi: प्रारंभिक टॉवर दर्ज करें

# towerRangeToLabel
source: Tower Range To
hi: टॉवर रेंज तक

source: Enter end tower
hi: अंतिम टॉवर दर्ज करें

source: Valid positive number required
hi: मान्य धनात्मक संख्या आवश्यक है

# towerRangeValuesPositive
source: Tower range values must be positive.
hi: टॉवर रेंज मान धनात्मक होने चाहिए।

# towerRangeFromGreaterThanTo
source: Tower range "From" cannot be greater than "To".
hi: टॉवर रेंज "से" "तक" से अधिक नहीं हो सकती।

# totalTowersLabel
source: Total Towers
hi: कुल टावर

# previewLabel
source: Preview
hi: पूर्वावलोकन

source: Add Line
hi: लाइन जोड़ें

source: Update Line
hi: लाइन अपडेट करें

source: Cancel Edit
hi: संपादन रद्द करें

source: Transmission Line added successfully!
hi: ट्रांसमिशन लाइन सफलतापूर्वक जोड़ी गई!

source: Transmission Line updated successfully!
hi: ट्रांसमिशन लाइन सफलतापूर्वक अपडेट की गई!

# errorSavingLine
source: Error saving line: {error}
hi: लाइन सहेजने में त्रुटि: {error}

source: Existing Transmission Lines
hi: मौजूदा ट्रांसमिशन लाइनें

# noTransmissionLinesAdded
source: No transmission lines added yet.
hi: अभी तक कोई ट्रांसमिशन लाइन नहीं जोड़ी गई है।

source: Transmission Line deleted successfully!
hi: ट्रांसमिशन लाइन सफलतापूर्वक हटाई गई!

# errorDeletingLine
source: Error deleting line: {error}
hi: लाइन हटाने में त्रुटि: {error}

# confirmDeletionText
source: Are you sure you want to delete this transmission line? This action cannot be undone.
hi: क्या आप इस ट्रांसमिशन लाइन को हटाना चाहते हैं? यह कार्रवाई पूर्ववत नहीं की जा सकती।

source: Edit
hi: संपादित करें

# deleteOption
source: Delete
hi: मिटाएँ

# assignLinesToManager
source: Assign Lines to {managerName}
hi: लाइनें असाइन करें {managerName} को

source: Search Lines
hi: लाइनें खोजें

source: No lines available to assign.
hi: असाइन करने के लिए कोई लाइन उपलब्ध नहीं है।

# noLinesFoundSearch
source: No lines found matching your search.
hi: आपकी खोज से मेल खाने वाली कोई लाइन नहीं मिली।

# saveAssignments
source: Save
hi: सहेजें

# cancelAssignments
source: Cancel
hi: रद्द करें

source: No changes to save.
hi: सहेजने के लिए कोई परिवर्तन नहीं।

# linesAssignedSuccessfully
source: Lines assigned to {managerName} successfully!
hi: लाइनें {managerName} को सफलतापूर्वक असाइन की गईं!

# failedToUpdateAssignedLines
source: Failed to update assigned lines: {error}
hi: असाइन की गई लाइनें अपडेट करने में विफल: {error}

# userManagementTitle
source: User Management
hi: उपयोगकर्ता प्रबंधन

source: Search Users
hi: उपयोगकर्ता खोजें

source: Search by name or email
hi: नाम या ईमेल द्वारा खोजें

# noUserProfilesFound
source: No user profiles found in the system.
hi: सिस्टम में कोई उपयोगकर्ता प्रोफ़ाइल नहीं मिली।

# noUsersFoundMatchingFilters
source: No users found matching current filters/search.
hi: वर्तमान फ़िल्टर/खोज से मेल खाने वाले कोई उपयोगकर्ता नहीं मिले।

# roleLabel
source: Role
hi: भूमिका

# statusFilterLabel
source: Status
hi: स्थिति

source: Manage
hi: प्रबंधित करें

# assignLinesButton
source: Assign Lines
hi: लाइनें असाइन करें

# deleteProfileButton
source: Delete Profile
hi: प्रोफ़ाइल मिटाएँ

# confirmRejectionDeletion
source: Confirm Rejection and Deletion
hi: अस्वीकृति और विलोपन की पुष्टि करें

# rejectDeleteConfirmation
source: Are you sure you want to REJECT and DELETE this user's profile ({userEmail})? This action is irreversible.
hi: क्या आप इस उपयोगकर्ता की प्रोफ़ाइल ({userEmail}) को अस्वीकृत और हटाना चाहते हैं? यह कार्रवाई अपरिवर्तनीय है।

# userProfileRejectedDeletedSuccessfully
source: User profile rejected and deleted successfully!
hi: उपयोगकर्ता प्रोफ़ाइल सफलतापूर्वक अस्वीकृत और हटा दी गई!

source: Rejection/deletion cancelled.
hi: अस्वीकृति/विलोपन रद्द कर दिया गया।

# userStatusUpdated
source: User status updated to {newStatus}.
hi: उपयोगकर्ता की स्थिति {newStatus} पर अपडेट की गई।

# failedToUpdateUser
source: Failed to update user: {error}
hi: उपयोगकर्ता को अपडेट करने में विफल: {error}

# userProfileDeleted
source: User profile for {userEmail} deleted.
hi: उपयोगकर्ता प्रोफ़ाइल {userEmail} हटा दी गई।

# managerEmail
source: Email: {email}
hi: ईमेल: {email}

source: Managed Lines:
hi: प्रबंधित लाइनें:

# noManagedLines
source: This manager is not assigned to manage any transmission lines.
hi: इस प्रबंधक को कोई ट्रांसमिशन लाइन प्रबंधित करने के लिए असाइन नहीं किया गया है।

# totalTowersManaged
source: Total Towers Managed: {count}
hi: कुल टावर प्रबंधित: {count}

# tasksAssignedBy
source: Tasks Assigned by {managerName}:
hi: {managerName} द्वारा असाइन किए गए कार्य:

# noAssignedTasksManager
source: This manager has not assigned any tasks yet.
hi: इस प्रबंधक ने अभी तक कोई कार्य असाइन नहीं किया है।

# assignedToUser
source: Assigned to
hi: असाइन किया गया:

# linePatrollingDetailsScreenTitle
source: {lineName} Details
hi: {lineName} विवरण

source: Search Tower Number or Details
hi: टॉवर संख्या या विवरण खोजें

# noSurveyRecordsFoundForLine
source: No survey records found for this line.
hi: इस लाइन के लिए कोई सर्वेक्षण रिकॉर्ड नहीं मिला।

# noRecordsFoundMatchingFiltersLine
source: No records found matching current filters.
hi: वर्तमान फ़िल्टर से मेल खाने वाले कोई रिकॉर्ड नहीं मिले।

source: Record ID
hi: रिकॉर्ड आईडी

# lineNameDisplay
source: Line Name
hi: लाइन का नाम

source: Task ID
hi: कार्य आईडी

source: User ID
hi: उपयोगकर्ता आईडी

source: Latitude
hi: अक्षांश

source: Longitude
hi: देशांतर

source: Overall Issue Status
hi: समग्र समस्या स्थिति

# issueStatus
source: Issue
hi: मुद्दा

# okStatus
source: OK
hi: ठीक है

source: Filter Records
hi: रिकॉर्ड फ़िल्टर करें

source: Clear Filters
hi: फ़िल्टर साफ़ करें

# accountRoleUnassigned
source: Your account role is not assigned or recognized.
hi: आपकी खाता भूमिका असाइन या पहचानी नहीं गई है।

# accountRoleExplanation
source: Please ensure your role (Worker, Manager, or Admin) is correctly assigned by an administrator in the Firebase Console.
hi: कृपया सुनिश्चित करें कि आपकी भूमिका (कार्यकर्ता, प्रबंधक, या प्रशासक) Firebase कंसोल में एक प्रशासक द्वारा सही ढंग से असाइन की गई है।

source: Admin Dashboard Summary
hi: व्यवस्थापक डैशबोर्ड सारांश

# totalManagersCount
source: Total Managers:
hi: कुल प्रबंधक:

# totalWorkersCount
source: Total Workers:
hi: कुल कार्यकर्ता:

# totalLinesCount
source: Total Lines:
hi: कुल लाइनें:

# totalTowersInSystemCount
source: Total Towers in System:
hi: सिस्टम में कुल टावर:

# pendingApprovalsCount
source: Pending Approvals:
hi: लंबित अनुमोदन:

# latestPendingRequestsTitle
source: Latest Pending Requests
hi: नवीनतम लंबित अनुरोध

# noPendingRequestsTitle
source: No pending requests.
hi: कोई लंबित अनुरोध नहीं।

# managersAssignmentsTitle
source: Managers & Their Assignments
hi: प्रबंधक और उनके असाइनमेंट

# noManagersFoundTitle
source: No managers found.
hi: कोई प्रबंधक नहीं मिला।

# progressByWorkerTitle
source: Progress by Worker:
hi: कार्यकर्ता द्वारा प्रगति:
